{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Список доступных команд:\n",
      "по команде \"p\" можете узнать владельца документа по его номеру\n",
      "по команде \"s\" можете по номеру документа узнать на какой полке он хранится\n",
      "по команде \"l\" можете увидеть полную информацию по всем документам\n",
      "по команде \"ads\" можете добавить новую полку\n",
      "по команде \"ds\" можете удалить существующую полку из данных (только если она пустая)\n",
      "по команде \"q\" - выход\n",
      "Введите команду: ds\n",
      "Введите номер полки: 1\n",
      "На полке есть документы, удалите их перед удалением полки. Текущий перечень полок: 1, 2, 3\n",
      "Введите команду: ds\n",
      "Введите номер полки: 4\n",
      "Такой полки не существует. Текущий перечень полок: 1, 2, 3\n",
      "Введите команду: ds\n",
      "Введите номер полки: 3\n",
      "Полка удалена. Текущий перечень полок: 1, 2\n",
      "Введите команду: q\n"
     ]
    }
   ],
   "source": [
    "# Вам нужно помочь секретарю автоматизировать работу. \n",
    "# Для этого нужно написать программу, которая будет на основе хранимых данных исполнять пользовательские команды.\n",
    "# Исходные данные имеют следующую структуру:\n",
    "#     перечень всех документов\n",
    "\n",
    "documents = [\n",
    "     {'type': 'passport', 'number': '2207 876234', 'name': 'Василий Гупкин'},\n",
    "     {'type': 'invoice', 'number': '11-2', 'name': 'Геннадий Покемонов'},\n",
    "     {'type': 'insurance', 'number': '10006', 'name': 'Аристарх Павлов'}\n",
    "    ]\n",
    "\n",
    "# перечень полок, на которых хранятся документы (если документ есть в documents, \n",
    "# то он обязательно должен быть и в directories)\n",
    "\n",
    "directories = {\n",
    "     '1': ['2207 876234', '11-2'],\n",
    "     '2': ['10006'],\n",
    "     '3': []\n",
    "    }\n",
    "\n",
    "# Пункт 1. Пользователь по команде \"p\" может узнать владельца документа по его номеру\n",
    "\n",
    "def holder():\n",
    "    number = input('Введите номер документа: ')\n",
    "    x = False\n",
    "    for i in documents:\n",
    "        if i['number'] == number:\n",
    "            print('Владелец документа:', i['name'])\n",
    "            x = True\n",
    "            break\n",
    "    if x == False:\n",
    "        print('Документ не найден в базе')\n",
    "\n",
    "#Пункт 2. Пользователь по команде \"s\" может по номеру документа узнать на какой полке он хранится\n",
    "def number():\n",
    "    number = input('Введите номер документа: ')\n",
    "    x = False\n",
    "    len_ = len(list(directories.keys()))\n",
    "    for i in range(1, len_ + 1):\n",
    "        i = str(i)\n",
    "        if number in directories[i]:\n",
    "            print('Документ хранится на полке:', i)\n",
    "            x = True\n",
    "            break\n",
    "    if x == False:\n",
    "        print('Документ не найден в базе')\n",
    "\n",
    "#Пункт 3. Пользователь по команде \"l\" может увидеть полную информацию по всем документам\n",
    "def inf():\n",
    "    len_ = len(list(directories.keys()))\n",
    "    for d in documents:\n",
    "        for i in range(1, len_ + 1):\n",
    "            i = str(i)\n",
    "            if d['number'] in directories[i]:\n",
    "                print('№ ', d['number'], ', тип: ', d['type'], ', владелец: ', d['name'], ', полка хранения: ', i, sep='')\n",
    "                break\n",
    "\n",
    "#Пункт 4. Пользователь по команде \"ads\" может добавить новую полку\n",
    "def ads():\n",
    "    number = input('Введите номер полки: ')\n",
    "    if number not in list(directories.keys()):\n",
    "        directories[number] = []\n",
    "        print('Полка добавлена. Текущий перечень полок: ', end='')\n",
    "        print(*list(directories.keys()), sep=', ')\n",
    "    else:\n",
    "        print('Такая полка уже существует. Текущий перечень полок: ', end='')\n",
    "        print(*list(directories.keys()), sep=', ')\n",
    "\n",
    "#Пункт 5. Пользователь по команде \"ds\" может удалить существующую полку из данных (только если она пустая)\n",
    "def delete():\n",
    "    number = input('Введите номер полки: ')\n",
    "    if number in list(directories.keys()) and directories[number] == []:\n",
    "        del directories[number]\n",
    "        print('Полка удалена. Текущий перечень полок: ', end='')\n",
    "        print(*list(directories.keys()), sep=', ')\n",
    "    elif number in directories and directories[number] != []:\n",
    "        print('На полке есть документы, удалите их перед удалением полки. Текущий перечень полок: ', end='')\n",
    "        print(*list(directories.keys()), sep=', ')\n",
    "    else:\n",
    "        print('Такой полки не существует. Текущий перечень полок: ', end='')\n",
    "        print(*list(directories.keys()), sep=', ')\n",
    "        \n",
    "print('Список доступных команд:')\n",
    "print('по команде \"p\" можете узнать владельца документа по его номеру', 'по команде \"s\" можете по номеру документа узнать на какой полке он хранится', 'по команде \"l\" можете увидеть полную информацию по всем документам', 'по команде \"ads\" можете добавить новую полку', 'по команде \"ds\" можете удалить существующую полку из данных (только если она пустая)', 'по команде \"q\" - выход', sep='\\n')\n",
    "\n",
    "command = ''\n",
    "while command != 'q':\n",
    "    command = input('Введите команду: ')\n",
    "    if command == 'p':\n",
    "        holder()\n",
    "    elif command == 's':\n",
    "        number()\n",
    "    elif command == 'l':\n",
    "        inf()\n",
    "    elif command == 'ads':\n",
    "        ads()\n",
    "    elif command == 'ds':\n",
    "        delete()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
